In [8]:
from common import return_dfs
t_df, c_df, adv_info = return_dfs()

In [10]:

t_order = t_df.groupby('address').sum('payment').drop('campaign_id', axis=1).sort_index()
c_order = c_df.groupby('address').sum('payment').drop('campaign_id', axis=1).sort_index()
t_order

                      payment
address
경기 수원시 권선구 서둔동 ****     12000
경기 수원시 권선구 세류2동 ****    10000
경기 수원시 권선구 평동 ****    2278000
경기 화성시 매송면 매송면 ****    970000
경기 화성시 봉담읍 봉담읍 ****    494000
경기도 수원시 권선구 평동 ****     32000

In [11]:
c_order

                      payment
address
경기 수원시 권선구 서둔동 ****     94000
경기 수원시 권선구 평동 ****    4222000
경기 수원시 권선구 호매실동 ****   165000
경기 화성시 기배동 ****        412000
경기 화성시 매송면 매송면 ****   1262000
경기 화성시 봉담읍 봉담읍 ****   1532000
경기도 수원시 권선구 평동 ****     16000
경기도 화성시 봉담읍 ****        17000

In [12]:
t_order['profit'] = t_order.payment - c_order.payment
t_order['profit_p'] = t_order.profit / c_order.payment * 100
t_order['compare_payment'] = c_order.payment
t_order = t_order[['payment', 'compare_payment', 'profit', 'profit_p']]
t_order

                      payment  compare_payment     profit    profit_p
address
경기 수원시 권선구 서둔동 ****     12000          94000.0   -82000.0  -87.234043
경기 수원시 권선구 세류2동 ****    10000              NaN        NaN         NaN
경기 수원시 권선구 평동 ****    2278000        4222000.0 -1944000.0  -46.044529
경기 화성시 매송면 매송면 ****    970000        1262000.0  -292000.0  -23.137876
경기 화성시 봉담읍 봉담읍 ****    494000        1532000.0 -1038000.0  -67.754569
경기도 수원시 권선구 평동 ****     32000          16000.0    16000.0  100.000000